#正则表达式 .*?表示任何字符
import re
text1="我是:习阿习,身高:180,密码:1234567889,电话号码:86-15565853567"
print(re.findall(r"身高",text1)) #r""里是需要找到的内容，re.findall找出所有符合条件的内容

#找到单个数字，单个
print(re.findall(r"\d",text1)) #\d表示所有数字，\D表示非数字
#结果数字是分开，只找到单个的['1', '8', '0', '1', '2', '3', '4', '5']

print(re.findall(r"[我,身]",text1))   #找到[]内的内容，[a-z]表示所有小写字母，[A-Z]

#重复某一类字符，连体
print(re.findall(r"\d+",text1))  #\d+表示一到多个数字，+修饰前面的\d
#['180', '1234567889']
print(re.findall(r"8+",text1))
#['8', '88']
print(re.findall(r"\d?",text1)) #?表示零个或多个，此处\d?表示没有数字或有数字的都包括。包括很多东西。单体
#['', '', '', '', '', '', '', '', '', '', '1', '8', '0', '', '', '', '', '1', '2', '3', '4', '5', '6', '7', '8', '8', '9', '']  

print(re.findall(r"\d*",text1)) #连体
#['', '', '', '', '', '', '', '', '', '', '180', '', '', '', '', '1234567889', '']

print(re.findall(r"\d[1-6]",text1))#\d[大小多少]  需要匹配的数字的范围
#['12', '34', '56']
print(re.findall(r"\d{1,3}",text1))#匹配几位的数字，\d{1,3}匹配一到三位数字
#['180', '123', '456', '788', '9']

#组合模式
print(re.findall(r"\d{2}-\d{11}",text1)) #模式的拼接\d{2}-\d{11}，两位数字-十一位数字（注意其中的连接符号-）
#['86-15565853567']

#多种情况
print(re.findall(r"\d{2}-\d{11}|1\d{10}",text1)) #|表示或，\d{2}-\d{11}或1\d{10}，1\d{10}表示1加十位数


#位置限定
print(re.findall(r"^1\d{2}|^1\d{10}",text1)) #^符号表示开头位置，$符号表示结尾

#内部约束
text2="barbar carcar"
print(re.findall(r"(\w{3})(\1)",text2)) #括号内部限定，(\1)表示和第二个括号的规则一样
#[('bar', 'bar'), ('car', 'car')]


#split分割
test3="wo,  ni  .  nishi:"
print(re.split(r"\s*[,.:]\s*",test3))